###  Groupby & Useful Methods in Pandas

In [2]:
import pandas as pd
import numpy as np

In [4]:
import seaborn as sns

In [5]:
df =sns.load_dataset("titanic")
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [6]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [14]:
df_groupby_sex = df.groupby("sex")
type(df_groupby_sex)

pandas.core.groupby.generic.DataFrameGroupBy

In [16]:
df_groupby_sex.ngroups # To get the number of groups

2

In [17]:
len(df_groupby_sex) # To get the number of groups

2

In [20]:
df_groupby_sex.size()

sex
female    314
male      577
dtype: int64

In [22]:
df_groupby_sex.first()

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
sex,,,,,,,,,,,,,,
female,1,1,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
male,0,3,22.0,1,0,7.2500,S,Third,man,True,E,Southampton,no,False

In [23]:
df_groupby_sex.last()

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
sex,,,,,,,,,,,,,,
female,0,3,19.0,1,2,23.45,S,Third,woman,False,B,Southampton,no,False
male,0,3,32.0,0,0,7.75,Q,Third,man,True,C,Queenstown,no,True

In [26]:
df_female = df_groupby_sex.get_group("female")
df_female.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [35]:
# ---------------------------

In [67]:
df3 = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.]})
df3

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [68]:
df3.groupby("Animal").mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [69]:
df3["Average_Life"] =[12,12,19,19]
df3

   Animal  Max Speed  Average_Life
0  Falcon      380.0            12
1  Falcon      370.0            12
2  Parrot       24.0            19
3  Parrot       26.0            19

In [71]:
bool_avr= df3["Average_Life"] > 12

In [72]:
df3[bool_avr]

   Animal  Max Speed  Average_Life
2  Parrot       24.0            19
3  Parrot       26.0            19

In [73]:
bool_speed = df3["Max Speed"] > 250
df3[bool_speed]

   Animal  Max Speed  Average_Life
0  Falcon      380.0            12
1  Falcon      370.0            12

In [75]:
# row adding

df3.loc[len(df3.index)] = ['Eagle', 250, 15] 
  
df3

   Animal  Max Speed  Average_Life
0  Falcon      380.0            12
1  Falcon      370.0            12
2  Parrot       24.0            19
3  Parrot       26.0            19
4  Falcon      380.0            12
5  Falcon      370.0            12
6  Parrot       24.0            19
7  Parrot       26.0            19
8   Eagle      250.0            15

In [79]:
df3.drop(range(4,8),axis=0,inplace=True)

In [80]:
df3

   Animal  Max Speed  Average_Life
0  Falcon      380.0            12
1  Falcon      370.0            12
2  Parrot       24.0            19
3  Parrot       26.0            19
8   Eagle      250.0            15

In [88]:
# resetting the index
df3.reset_index(drop=True,inplace=True)

In [89]:
df3

   Animal  Max Speed  Average_Life
0  Falcon      380.0            12
1  Falcon      370.0            12
2  Parrot       24.0            19
3  Parrot       26.0            19
4   Eagle      250.0            15

In [92]:
# row adding

df3.loc[5] = ["Bear", 65, 20]
df3

   Animal  Max Speed  Average_Life
0  Falcon      380.0            12
1  Falcon      370.0            12
2  Parrot       24.0            19
3  Parrot       26.0            19
4   Eagle      250.0            15
5    Bear       65.0            20

In [94]:

df3.groupby("Animal").mean()

        Max Speed  Average_Life   7
Animal
Bear         65.0          20.0 NaN
Eagle       250.0          15.0 NaN
Falcon      375.0          12.0 NaN
Parrot       25.0          19.0 NaN

In [102]:
df3.drop(7,axis=1, inplace=True)

In [103]:

df3.groupby("Animal").mean()

        Max Speed  Average_Life
Animal
Bear         65.0          20.0
Eagle       250.0          15.0
Falcon      375.0          12.0
Parrot       25.0          19.0

In [105]:
df3

   Animal  Max Speed  Average_Life
0  Falcon      380.0          12.0
1  Falcon      370.0          12.0
2  Parrot       24.0          19.0
3  Parrot       26.0          19.0
4   Eagle      250.0          15.0
5    Bear       65.0          20.0
6     NaN        NaN           NaN

In [110]:
df3.drop(6,inplace=True)

In [111]:
df3

   Animal  Max Speed  Average_Life
0  Falcon      380.0          12.0
1  Falcon      370.0          12.0
2  Parrot       24.0          19.0
3  Parrot       26.0          19.0
4   Eagle      250.0          15.0
5    Bear       65.0          20.0